{
    "University": "Monash",
    "courseCode": "SFTWRENG01",
    "CourseTitle": "Software engineering",
    "units": [
        {
            "unitCode": "MAT1830",
            "unitName": "Discrete mathematics for computer science",
            "unitLevel": "1",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "OCT-MY-01-MALAYSIA-ON-CAMPUS",
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.",
            "handbookURL": "https://handbook.monash.edu/2024/units/MAT1830"
        },
        {
            "unitCode": "FIT2004",
            "unitName": "Algorithms and data structures",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit introduces students to problem solving concepts and techniques fundamental to the science of programming. In doing this it covers problem specification, algorithmic design, analysis and implementation. Detailed topics include analysis of best, average and worst-case time and space complexity; introduction to numerical algorithms; recursion; advanced data structures such as heaps and B-trees; hashing; sorting algorithms; searching algorithms; graph algorithms; and numerical computing.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2004"
        },
        {
            "unitCode": "FIT2085",
            "unitName": "Fundamentals of algorithms for engineers",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, algorithms, algorithmic complexity, recursion, and their practical applications.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2085"
        },
        {
            "unitCode": "FIT2099",
            "unitName": "Object oriented design and implementation",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit introduces you to object-oriented design principles and their application to the construction of quality software. You will learn the fundamental concepts that underlie modern object-oriented languages, and will learn how to implement your designs using at least one. You will also learn how to use standard notation to illustrate your designs.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2099"
        },
        {
            "unitCode": "FIT2100",
            "unitName": "Operating systems",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit will provide students with the knowledge of how a multi-programming, multi-user operating systems operates and it manages and allocate resources to different applications. Students will be able to compare and contrast various resource management allocation strategies. Students will develop and implement code to understand and make use of operating system services.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2100"
        },
        {
            "unitCode": "FIT2101",
            "unitName": "Software engineering process and management",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "A disciplined process is vital to the success of any major software development project. In this unit, you will learn essential skills for managing software development efforts and for working within coordinated teams. You will learn how to decide upon and document your team's structure and process model. Your team will be expected to follow the process model they have documented, and to evaluate its effectiveness.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2101"
        },
        {
            "unitCode": "FIT2107",
            "unitName": "Software quality and testing",
            "unitLevel": "2",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit focuses on modern software quality assurance and testing tools and techniques to assure the quality of software systems. Students will learn different quality aspects of quality attributes, e.g., reliability, human, and security. Students will design test cases and apply systematic testing techniques in the context of individual modules and entire systems, using appropriate tools and techniques to automate the testing process where possible. Finally, students will analyze and report code quality issues using modern code review practices with tools and measures.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT2107"
        },
        {
            "unitCode": "FIT3077",
            "unitName": "Software engineering: Architecture and design",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit builds on introductory units to analysis and design. It provides the professional software engineer with advanced knowledge and skills in high-level architectural design, its theoretical foundations, industrial best practice, and relevant application context. In the software life-cycle, software architecture sits between analysis/specification and design/implementation. The field of software architecture has come of age with a thriving research community and numerous high-level models, methods, tools and practices widely used in industry.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3077"
        },
        {
            "unitCode": "FIT3159",
            "unitName": "Computer architecture",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit covers the internal mechanism of computers and how they are organised and programmed. Topics include combinatorial and sequential logic, Boolean Algebra, counters, ripple adders, tree adders, memory/addressing, busses, speed, DMA, data representation, machine arithmetic, microprogramming, caches and cache architectures, virtual memory and translation look-aside buffers, vectored interrupts, polled interrupts, pipelined architecture, superscalar architecture, data dependency, hazards, CISC, RISC, VLIW machine architectures.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3159"
        },
        {
            "unitCode": "FIT3170",
            "unitName": "Software engineering practice",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "12",
            "offerings": [
                "FY-01-CLAYTON-ON-CAMPUS",
                "FY-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "In this unit, students will undertake a full-year software development project in a self-managing team. Students will apply the skills they learned in prerequisite and co-requisite units to a larger project than any they have encountered to date. Through attempting larger-scale software development they will learn how the techniques they have encountered in isolation work together as an integrated methodology to make such complex projects feasible.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3170"
        },
        {
            "unitCode": "FIT3171",
            "unitName": "Databases",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS",
                "SSB-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "This unit will provide an introduction to the concepts of database design and usage and the related issues of data management. You will develop skills in planning, designing, and implementing a data model using an enterprise-scale relational database system (Oracle). Methods and techniques will also be presented to populate, retrieve, update and implement integrity features on data in the implemented database system.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3171"
        },
        {
            "unitCode": "FIT4165",
            "unitName": "Computer networks",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "The unit introduces computer networks with an explicit software and system-centric focus. It provides skills in data communications, networks, and associated software interfaces, and introduces principles in network design, configuration, management and security.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4165"
        },
        {
            "unitCode": "FIT4002",
            "unitName": "Software engineering industry experience studio project",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "12",
            "offerings": [
                "FY-01-CLAYTON-FLEXIBLE",
                "FY-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Students will undertake a large project and work in groups on a software project for a client. The client may be internal to Monash or from the industry or research organisation. In general, projects involve all aspects of the system development lifecycle. Groups are responsible for their own project management, with guidance from a supervisor. Some projects will warrant students working in pairs or individually.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4002"
        },
        {
            "unitCode": "FIT4701",
            "unitName": "Final year software engineering project A",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4701"
        },
        {
            "unitCode": "FIT4702",
            "unitName": "Final year software engineering project B",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit is a continuation of FIT4701 Final year software engineering project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4702"
        },
        {
            "unitCode": "FIT4042",
            "unitName": "Industry",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "18",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Students are on placement full time in a defined, graduate level role during a 22-week placement period at established partners of the Faculty of IT industry based learning program including major global companies, leading Australian companies and worldwide consultancies. The students on placement apply the knowledge, skills and practices of professional attitudes and behaviour developed in their academic units. They develop communication, time management, self-reflection and customer service skills in business situations, experience and participate professionally in the corporate environment and obtain feedback from experienced supervisors on their performance.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4042"
        },
        {
            "unitCode": "ENG0001",
            "unitName": "Engineering continuous professional development",
            "unitLevel": "0",
            "unitType": null,
            "faculty": "Faculty of Engineering",
            "creditPoints": "0",
            "offerings": [
                "S1-01-CLAYTON-IMMERSIVE",
                "S2-01-CLAYTON-IMMERSIVE"
            ],
            "unitDescription": "Continuous professional development (CPD) is a compulsory requirement for all engineering students. It is part of meeting the Engineers Australia Stage 1 Competency Standard to be a Professional Engineer.",
            "handbookURL": "https://handbook.monash.edu/2024/units/ENG0001"
        },
        {
            "unitCode": "ENG0002",
            "unitName": "Industrial training",
            "unitLevel": "0",
            "unitType": null,
            "faculty": "Faculty of Engineering",
            "creditPoints": "0",
            "offerings": [
                "SSB-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "In the internship, you acquire experience by working in a professional environment in engineering industries over 12 weeks. The internship includes considerations of engineering health and safety, teamwork, communication and life-long learning in the workplace and the development of a workplace written report.",
            "handbookURL": "https://handbook.monash.edu/2024/units/ENG0002"
        },
        {
            "unitCode": "FIT3003",
            "unitName": "Business intelligence and data warehousing",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Automation and the use of technological tools have resulted in the accumulation of vast volumes of data by modern business organisations. Data warehouses have been set up as repositories to store this data and improved techniques now result in the speedy collection and integration of such data. OLAP technology has resulted in the faster generation of reports and more flexible analysis based on the data repositories. This unit will explore the concepts of data warehousing and OLAP, covering the data processing technological requirements for data warehousing and OLAP and will provide hands on experience on designing data warehousing and OLAP systems.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3003"
        },
        {
            "unitCode": "FIT3031",
            "unitName": "Network security",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit will provide students with an understanding of: OSI security architecture; common information risks and requirements; operation of encryption techniques; digital signatures; public key infrastructure; authentication and non-repudiation; intrusion detection and response; firewall defence; privacy and ethics issues; security configurations to PC-based applications; and design of information systems with security compliance and security standards and protocols.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3031"
        },
        {
            "unitCode": "FIT3080",
            "unitName": "Artificial intelligence",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit includes history of artificial intelligence; intelligent agents; problem solving and search (problem representation, heuristic search, iterative improvement, game playing); knowledge representation and reasoning (extension of material on propositional and first-order logic for artificial intelligence applications, planning, frames and semantic networks); reasoning under uncertainty (belief networks); machine learning (decision trees, Naive Bayes, neural nets and genetic algorithms); language technology.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3080"
        },
        {
            "unitCode": "FIT3094",
            "unitName": "Artificial life, artificial intelligence and virtual environments",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit introduces topics in Artificial Intelligence (AI) and Artificial Life (ALife) suited to real-time simulation and computer games development. Using a practice-based and programming-led approach, the unit explores elements of the history of these fields, and their application to games, the fields’ fundamental concepts and theory, as well as practical techniques and algorithms that can be used to build real-time, interactive games, virtual environments and simulations. Starting with basic concepts in 2D discrete simulation, the unit progresses to continuous 3D models, agent-based models, bio-inspired intelligence and search algorithms. Programs are developed primarily using C++.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3094"
        },
        {
            "unitCode": "FIT3134",
            "unitName": "Entrepreneurship",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "SSA-02-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Over the past few years, the world has seen disruptive ideas spearheaded by entrepreneurs and the startups that they lead. Often, these startups are backed by strong technological advancements that power rapid growth, giving birth to the term technopreneurship. This unit aims to empower students with the essential knowledge, skills, and tools to bring a technology idea to a venture-backable startup. This includes topics such as (1) team, (2) vision; (3) problem; (4) market; (5) solution; (6) business model; (7) go-to-market; (8) competitors; (9) traction/ metrics; and (10) investment ask.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3134"
        },
        {
            "unitCode": "FIT3138",
            "unitName": "Real time enterprise systems",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit provides both a theoretical and practical overview of real time enterprise systems. Real time enterprise systems are configurable information systems packages, implemented on-line that integrate people, technology and information processing. The three integrated processes within and across functional areas are seamlessly interconnected and almost time-lag free in an organisation. Topics include systems and technology background, ES evolution, ES lifecycle, implementation and configuration, ES and electronic commerce and ES success and failure factors. The theoretical component will be augmented by detailed case studies which focus on problems faced by real-life companies. For the practical component, laboratory exercises using a well-known enterprise system will be used to deepen student understanding.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3138"
        },
        {
            "unitCode": "FIT3139",
            "unitName": "Computational modelling and simulation",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit provides an overview of computational science and an introduction to its central methods. It covers the role of computational tools and methods in 21st century science, emphasising modelling and simulation. It introduces a variety of models, providing contrasting studies on: continuous versus discrete models; analytical versus numerical models; deterministic versus stochastic models; and static versus dynamic models. Other topics include: Monte-Carlo methods; epistemology of simulations; visualisation; high-dimensional data analysis; optimisation; limitations of numerical methods; high-performance computing and data-intensive research.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3139"
        },
        {
            "unitCode": "FIT3143",
            "unitName": "Parallel computing",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Modern computer systems contain parallelism in both hardware and software. This unit covers parallelism in both general purpose and application specific computer architectures and the programming paradigms that allow parallelism to be exploited in software. The unit examines shared memory and message passing paradigms in hardware and software; concurrency, multithreading and synchronicity; parallel, clustered and distributed supercomputing algorithms, languages and software tools and development environments. Students will learn to design and develop parallel algorithms in these paradigms, and apply technical writing and presentation to communicate parallel computing.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3143"
        },
        {
            "unitCode": "FIT3146",
            "unitName": "Maker lab",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "This unit will enable students to create new artefacts which utilise developments in information technology. The unit will combine the theoretical and technical skills gained in other units into a problem solving context and allow the students to gain the skills needed to create solutions of problems using technology. Students will learn valuable research and communication skills as they explore and create using a variety of technologies that support the making process. Student will have the opportunity to explore new technologies and undertake the prototyping and refinement process in an environment that supports independent learning. Students will have the opportunity to use technology to solve a problem which is of interest.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3146"
        },
        {
            "unitCode": "FIT3152",
            "unitName": "Data analytics",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS",
                "S1-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "There has been an explosion in the quantity and variety of data collected and routinely analysed by government, business and society at large over recent years. This has been described by some social commentators as the rise of \"big data\" and and the analysts and practitioners who investigate this data as \"data scientists.\" This unit will introduce students to the analysis of big data and the role of the data scientist. Techniques covered include data management and transformation, visual analysis, social network analysis, statistical learning, clustering and natural language processing. Students will be introduced to these methods using open source industry standard software. Data and case studies will be drawn from diverse sources. The general principles of analysis, investigation and reporting will be covered. Students will be encouraged to critically reflect on the data analysis process within their own domain of interest.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3152"
        },
        {
            "unitCode": "FIT3154",
            "unitName": "Advanced data analysis",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit introduces the problem of machine learning and the major kinds of statistical learning used in data analysis. Learning and the different kinds of learning will be covered and their usage discussed. Evaluation techniques and typical application contexts will presented. A series of different models and algorithms will be presented in an exploratory way: looking at typical data, the basic models and algorithms and their use: linear and logistic regression, support vector machines, Bayesian networks, decision trees, random forests, k-means and clustering, neural-networks, deep learning, and others. Finally, two specialist topics will be covered briefly, statistical learning theory and working with big data.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3154"
        },
        {
            "unitCode": "FIT3155",
            "unitName": "Advanced data structures and algorithms",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit builds on the concepts learnt in introductory algorithms and data structures study. It covers advanced algorithmic paradigms and problem-solving techniques required to address real-world programming challenges. It explores, in depth, the design and analysis of space-efficient data structures and time-efficient problem solving strategies to be used with them. Topics include amortized analysis, advanced sorting and searching algorithms, new tree/string/graph data structures and algorithms, and number-theoretic algorithms amongst others.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3155"
        },
        {
            "unitCode": "FIT3168",
            "unitName": "IT forensics",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "This unit provides a broad coverage of digital ICT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation and analysis of evidence. Disk-based (local) and network (remote) forensic environments will be explored. You will also learn of the impediments and complicating factors that can threaten forensic investigations.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3168"
        },
        {
            "unitCode": "FIT3169",
            "unitName": "Immersive environments",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "FIT3169 introduces students to immersive environment design and production principles using game engine prototyping software. Building upon the 3D creation and editing skills in the prerequisite unit FIT1033 Foundations of 3D, students will learn how to create game levels, import assets (models, sounds, animations), and extend supplied code to visualise interactive virtual environments for a range of applications and devices.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3169"
        },
        {
            "unitCode": "FIT3173",
            "unitName": "Software security",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "SSB-01-CLAYTON-FLX-BLK"
            ],
            "unitDescription": "This unit aims to introduce secure software development issues from the design stage, through to implementation, testing and deployment. Topics studied include the secure software development life cycle, secure software design principles, threat evaluation models, secure coding and development practices, software security testing, deployment and maintenance. Students are provided with a range of practical exercises and tasks to reinforce their skills including: identification of security bugs in programs written in different programming languages, design, implementation, and testing of secure concurrent and networked applications and identification of vulnerabilities in networked and mobile/wireless applications.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3173"
        },
        {
            "unitCode": "FIT3175",
            "unitName": "Usability",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "SSB-01-CLAYTON-FLX-BLK"
            ],
            "unitDescription": "This unit explores the underpinning theories, principles and practices of interface design to achieve usable computer-based systems. It examines issues in the design of system interfaces from a number of perspectives: user, programmer, designer. It explores the application of the relevant theories in practice. The unit will cover topics such as methods and tools for developing effective user interfaces, evaluation methods such as the conduct of usability and heuristic evaluations, design of appropriate interface elements including the design of menus and other interaction styles. The unit will also focus on designing for a diverse range of users and environments.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3175"
        },
        {
            "unitCode": "FIT3176",
            "unitName": "Advanced database design",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit will introduce advanced concepts in the areas of database design, including document-store, column-store, and graph database design; implementations in non-relational database systems.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3176"
        },
        {
            "unitCode": "FIT3178",
            "unitName": "iOS app development",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit focuses on the design, development and deployment of mobile apps for iOS using the Swift programming language. Students will learn best practices for iOS development using native frameworks and common design patterns. The unit will explore areas such as mobile UI design, data storage, web services and networking, mobile sensors, use of media, and mobile interface testing. The unit will emphasise hands-on, practical experience with the Xcode development environment and iOS simulator. Students will design and build their own app.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3178"
        },
        {
            "unitCode": "FIT3179",
            "unitName": "Data visualisation",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas of application. It investigates the reasons why visualisation can be effective and based on this students will gain experience in critically assessing data visualisations and in designing their own visualisations. You will learn how to create visualisations with representative computer tools and gain experience in creating a data visualisation for an application domain of their choice.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3179"
        },
        {
            "unitCode": "FIT3182",
            "unitName": "Big data management and processing",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "Data engineering is about developing the software (and hardware) infrastructure to support data science. This unit introduces software tools and techniques for data engineering, but not hardware. It will cover an introduction to big data processing, covering volume, variety, and velocity; large volume data processing using parallel technologies; variety data formats, including unstructured and semi-structured data, using NoSQL databases; and velocity data processing, covering data streaming.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3182"
        },
        {
            "unitCode": "FIT3183",
            "unitName": "Malicious AI and dark side security",
            "unitLevel": "3",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "In this unit you will learn first-hand some of the required skills of a Chief Security Officer. You will be exposed to the latest technologies deployed by attackers against AI and security, and mechanisms to counter these malicious activities. This unit gives you the opportunity to engage in role-playing case studies wherein you will be required to participate against other students in a security warfare: security vs anti-security technologies, such as, deepfakes vs anti-deepfakes, forensics vs counter forensics.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT3183"
        },
        {
            "unitCode": "FIT4005",
            "unitName": "IT research methods",
            "unitLevel": "4",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "The aim of this unit is to prepare students to conduct research in an industry IT context. It provides broad coverage of the issues, concepts, methods, and techniques associated with the diverse responsibilities expected from the contemporary IT professional as they evaluate products, conduct R&D and plan product feature development. It introduces students to major research paradigms, the principles of research design, research ethics, and research methods and techniques of data collection and analysis appropriate to research in the IT industry. It covers how to effectively communicate the results of a piece of research through the established method of short-form video. Skills developed and knowledge acquired from this unit will prepare students to plan, conduct and communicate research within an IT organisation, as well as to be knowledgeable and critical interpreters of research more generally.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT4005"
        },
        {
            "unitCode": "FIT5003",
            "unitName": "Software security",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit aims to introduce the secure software development issues including secure software development life cycle, secure software design principles, secure coding practices, threat evaluation models, secure software testing, deployment and maintenance, software development and security policy integration. Students are provided with a range of practical exercises and tasks to reinforce their skills including: identification of security bugs in programs written in different programming languages, design, implementation, and testing of secure concurrent and networked applications, identification of vulnerabilities in networked and mobile/wireless applications. In addition, students will learn input validation techniques to minimise security risks, man-in-the-middle attack techniques to be able to build more secure networked applications, practical secure software testing techniques to be able to test applications for security bugs.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5003"
        },
        {
            "unitCode": "FIT5032",
            "unitName": "Internet applications development",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "This unit provides students with the knowledge, understanding and skills required to develop an application system which uses a web interface to a back-end database. The unit assumes a sound basic knowledge of programming and database concepts and skills as developed in the introductory units in these areas. The emphasis in the unit is on mastery of the key concepts and the basic knowledge and skills required to build this kind of application. The unit will provide students with an awareness of the wide range of technologies which are used to support this kind of application, but will examine only a limited number of these technologies to demonstrate the key concepts and their application.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5032"
        },
        {
            "unitCode": "FIT5037",
            "unitName": "Network security",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "Network security is an important part of any computer network and essential knowledge for IT professionals. This unit provides fundamental network security for IT students and professionals. It covers wired and wireless communication and network security, security at different layers, computer system security, network services and applications security, basic defence systems, cryptography for network security, techniques for identifying system vulnerabilities and penetration testing.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5037"
        },
        {
            "unitCode": "FIT5046",
            "unitName": "Mobile and distributed computing systems",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "This unit provides a high level coverage of mobile and distributed computing. It will focus on the underlying concepts and standards of mobile computing. Students will learn techniques to design and develop mobile applications. The unit will also provide students with an understanding of current mobile and distributed technologies such as web services, Internet of Things, context-aware computing, location-awareness, wireless sensor networks and current research trends.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5046"
        },
        {
            "unitCode": "FIT5124",
            "unitName": "Emerging topics for cybersecurity in practice",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit aims to provide students with advanced knowledge of cybersecurity. Advancements in cloud services, mobile computing, and machine learning bring much convenience to our lives, improve our productivity in daily work, and provide us with personalised services. Despite many benefits, these new paradigms incur aggravated security and privacy concerns. End-users, enterprises, and governments face growing threats from sophisticated cyber attacks. This unit will study advanced cybersecurity technologies to address those threats in the current practice. Topics include design and implementation of advanced cryptosystems for high-performance applications such as encrypted databases, cryptographic protocols and hardware-assisted approaches for secure computing applications such as privacy-preserving machine learning, and practical post-quantum cryptography that can address the emerging threats of quantum computers. Learning activities will focus on understanding security and privacy issues in cloud and networked systems, encrypted search techniques, cloud storage security, secure multi-party computation techniques, trusted computing, and lattice-based cryptography.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5124"
        },
        {
            "unitCode": "FIT5129",
            "unitName": "Cyber operations",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "An effective cybersecurity practitioner requires knowledge from multiple disciplines, including computer science, mathematics, psychology, sociology, criminology, law, economics, and engineering. This unit considers the intersection of the technical, psychological, and sociological aspects involved in maintaining security within organisations. The unit will provide students with practical foundations in planning secure networks, policy-based operations, and the implementation of security. Students will also be introduced to best practices in dealing with security breaches. Critical reflective and practical skills will be acquired through reflective reading and considering real-world applications.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5129"
        },
        {
            "unitCode": "FIT5137",
            "unitName": "Advanced database technology",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit examines advanced database technology. This unit particularly covers three main types of advanced database technologies, including (i) document store, (ii) wide column store, and (iii) graph database. These three systems represent the broad spectrum of NoSQL databases. The underlying theoretical foundations, such as database modelling, transactions, and graph query processing will also be explored.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5137"
        },
        {
            "unitCode": "FIT5145",
            "unitName": "Foundations of data science",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS"
            ],
            "unitDescription": "This unit looks at processes, case studies and simple tools to understand the many facets of working with data, and the significant effort in Data Science over and above the core task of Data Analysis. Working with data as part of a business model and the lifecycle in an organisation is considered, as well as business processes and case studies. Data and its handling is also introduced: characteristic kinds of data and its collection, data storage and basic kinds of data preparation, data cleaning and data stream processing. Styles of data analysis and outcomes of successful data exploration and analysis are reviewed. Standards, tools and resources are also reviewed. Basic curation and management are reviewed: archival and architectural practice, policy, legal and ethical issues.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5145"
        },
        {
            "unitCode": "FIT5163",
            "unitName": "Information and computer security",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S2-01-CLAYTON-FLEXIBLE",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "The unit aims to provide the students with in depth knowledge of techniques required to deal with security problems in information systems. The main areas of study include symmetric and asymmetric encryption techniques, cryptographic hash functions with related topics of message authentication codes and digital signatures. Study of techniques and algorithms for providing mutual trust include key management and distribution and user authentication to establish trust in the identity of communicating partner are also included. It looks at various management issues, including use and abuse of encryption, distributed systems authentication and integrity management. A range of security applications are used as examples. Students will learn how to apply cryptographic techniques in practice.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5163"
        },
        {
            "unitCode": "FIT5201",
            "unitName": "Machine learning",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S1-01-OS-CHI-SEU-ON-CAMPUS",
                "S2-01-CLAYTON-FLEXIBLE"
            ],
            "unitDescription": "This unit introduces machine learning and the major kinds of statistical learning models and algorithms used in data analysis. Learning and the different kinds of learning will be covered and their usage will be discussed. The unit presents foundational concepts in machine learning and statistical learning theory, e.g. bias-variance, model selection, and how model complexity interplays with model's performance on unobserved data. A series of different models and algorithms will be presented and interpreted based on the foundational concepts: linear models for regression and classification (e.g. linear basis function models, logistic regression, Bayesian classifiers, generalised linear models), discriminative, probabilistic, and generative models, non-parametric models (e.g., k-nearest neighbour, Gaussian process regression), k-means and latent variable models (e.g. Gaussian mixture model), expectation-maximisation, and neural networks and deep learning. Moreover, implementation techniques will be introduced and practiced that allow to practically implement the introduced algorithms in a scalable manner with robust and standardised interfaces.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5201"
        },
        {
            "unitCode": "FIT5202",
            "unitName": "Data processing for big data",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-MALAYSIA-EVENING",
                "S2-01-CLAYTON-FLEXIBLE",
                "SSB-01-CLAYTON-FLX-BLK"
            ],
            "unitDescription": "This unit focuses on big data processing, including volume, complexity, and velocity using the latest big data technologies. In big data volume, it covers large volume data processing using parallel technologies. In large dimensionality (or complexity), it covers various data analytics methods for parallel processing. For the velocity, it covers data streaming processing.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5202"
        },
        {
            "unitCode": "FIT5214",
            "unitName": "Blockchain",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [],
            "unitDescription": "Blockchain is regarded as the next revolution of Internet. Applications are not just limited to cryptocurrencies such as Bitcoin, but also extended to different interdisciplinary sectors. This unit is for students to develop basic knowledge of blockchain technology and how they can be used in real-world scenarios such as payment systems or supply-chain management. Learning activities will focus on understanding different blockchain systems, a broad landscape of supervised and unsupervised learning methods with a focus on the state-of-the-art knowledge for blockchain technologies including consensus, privacy-preserving protocols and smart contract which are rapidly used in different industries.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5214"
        },
        {
            "unitCode": "FIT5215",
            "unitName": "Deep learning",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-FLEXIBLE",
                "S2-01-MALAYSIA-ON-CAMPUS",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "Modern machine learning provides core underlying theory and techniques to data science and artificial intelligence. This unit is for students to develop practical knowledge of modern machine learning and deep learning and how they can be used in real-world settings such as image recognition or text clustering via neural embeddings. Learning activities will focus on designing machine learning systems, a broad landscape of supervised and unsupervised learning methods with a focus on modern deep learning knowledge for data analytics including deep neural networks, representation learning and embedding methods, and deep models used for time-series data which are rapidly used in science and industry.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5215"
        },
        {
            "unitCode": "FIT5216",
            "unitName": "Modelling discrete optimisation problems",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "S1-01-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "This unit introduces the fundamentals of modelling for discrete optimisation, focusing on how to rigorously express a discrete optimisation problem in a manner that is can be solved. Topics covered will include decision variables, basic constraints, modelling with sets, modelling with functions, multiple modelling viewpoints, modelling time, common modelling patterns, model translation, and debugging discrete optimisation models. We will examine complex real world problems and see how they can be translated so that they can be solved by modern discrete optimisation technology.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5216"
        },
        {
            "unitCode": "FIT5217",
            "unitName": "Natural language processing",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-MALAYSIA-ON-CAMPUS",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "Natural language processing (NLP) stands as a cornerstone in the information age, made even more riveting with the rise of Generative AI and the introduction of models like LLM. NLP not only supports artificial intelligence in grasping intricate language nuances but also heralds a range of innovative applications. This unit delves into the fundamental principles of NLP, covering essential techniques for analyzing language syntax and meaning. We will also explore the neural network underpinnings of contemporary language models in the context of important real-world problems such as Machine Translation. Furthermore, we'll delve into the theoretical and practical foundations of recent LLMs.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5217"
        },
        {
            "unitCode": "FIT5221",
            "unitName": "Intelligent image and video analysis",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "This unit will discuss the fundamental and modern concepts in image and video analysis. The students will be introduced to the basics of image processing and low-level vision. The topics related to image formation, operations, features and segmentation will enable students with the understanding for developing vision enabled systems. Concepts related to convolutional neural networks (CNN) will be introduced and recent examples will be thoroughly analysed. Recent computer vision concepts will be discussed from a deep learning perspective. The unit will be balance between the theoretical and the practical implementation aspects of computer vision.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5221"
        },
        {
            "unitCode": "FIT5222",
            "unitName": "Planning and automated reasoning",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS",
                "T3-57-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "This unit focuses on the foundations of automated planning and reasoning and their real-world applications. Autonomous agents are active agents that independently execute actions to achieve a certain goal or goals. These agents perceive their environment and reason and plan in order to effect their environment and achieve their goals. This is a very popular and highly researched AI approach and has many significant implications beyond the traditional area of AI (optimisation, robotics, scheduling, etc?). This course will give students the foundations to develop and design their own autonomous agents.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5222"
        },
        {
            "unitCode": "FIT5223",
            "unitName": "IT forensics",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S2-01-CLAYTON-ON-CAMPUS"
            ],
            "unitDescription": "This unit provides a broad coverage of (digital) IT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation, and analysis of evidence. Disk-based (local) and network (remote) forensic environments will be explored. You will also learn of the impediments and complicating factors that can threaten forensic investigations.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5223"
        },
        {
            "unitCode": "FIT5225",
            "unitName": "Cloud computing and security",
            "unitLevel": "5",
            "unitType": null,
            "faculty": "Faculty of Information Technology",
            "creditPoints": "6",
            "offerings": [
                "S1-01-CLAYTON-FLEXIBLE",
                "S1-01-OS-CHI-SEU-ON-CAMPUS"
            ],
            "unitDescription": "Cloud computing has emerged as a backend solution for many modern IT applications. It offers on-demand resources and subscription-based services in a pay-as-you-go model to individual and corporate end-users. Cloud computing facilitates setup, implementation, maintenance, and management of the integrated computation and storage services. This unit will enable students to develop a basic knowledge of cloud computing technology and design and implement cloud applications using cloud services. It also introduces the security and privacy issues of the off-the-shelf cloud services. Learning activities will focus on understanding cloud delivery and service models, identifying various cloud platforms, and fundamental cloud technologies such as virtualisation, containers, serverless, web services and their security challenges.",
            "handbookURL": "https://handbook.monash.edu/2024/units/FIT5225"
        }
    ]
}